package Exercise3;

public class MainApp {
    // 3. Создать класс Park с внутренним классом, с помощью объектов которого
    // можно хранить информацию об аттракционах, времени их работы и стоимости.
    public static void main(String[] args) {
        System.out.println("Задание №3\n" );

        Park park1 = new Park("Филёвский");
        Park park2 = new Park("Сетунь");
        Park park3 = new Park("Тропарёвский");

        park1.addAttraction("Колесо обозрения \"Восьмёрка\"","09:00 - 18:00", 1000);
        park1.addAttraction("Карусель \"Карусельская местность\"", "09:00 - 18:00", 600);
        park1.addAttraction("Американские горки \"Русские горки\"", "09:00 - 18:00", 1200);

        park2.addAttraction("Колесо обозрения \"Люди-палки в колесе\"", "10:00 - 17:00", 1300);
        park2.addAttraction("Карусель \"Радость для нас\"", "10:00 - 17:00", 700);
        park2.addAttraction("Американские горки \"Горбатые горки\"", "10:00 - 17:00", 1600);

        park3.addAttraction("Колесо обозрения \"Пробитое колесо Фортуны\"", "09:00 - 21:00", 2000);
        park3.addAttraction("Карусель \"Сансара\"", "09:00 - 21:00", 400);
        park3.addAttraction("Американские горки \"Санки\"", "09:00 - 21:00", 900);
    }
}
